package code_mu.level4;

/**
 Напишите программу, которая сформирует следующую строку:
 "xxxxx"
 */
public class _412_Sout_xxxxx {
    public static void main(String[] args) {
        System.out.println("xxxxx");
    }
}
