package code_mu.level1;

/**
 * Уровень 1.1 задачника Java
 * № 112
 * <p>
 * Дана строка. Выведите в консоль длину этой строки.
 */

public class _112_StringLength {
    public static String strLength = "hello";

    public static void main(String[] args) {
        System.out.println(strLength.length());
    }
}
