package code_mu.level1;

/**
 * Уровень 13 задачника Java
 * № 133
 * <p>
 * Даны два целых числа. Найдите остаток от деления первого числа на второе.
 */

public class _133_RemainFromDivision {

    public static void main(String[] args) {
        int a = 5;
        int b = 2;
        System.out.println("Остаток от деления " + a + " на " + b + " равен " + a % b);
    }

}
