package code_mu.level1;

/**
 * Уровень 15 задачника Java
 * № 154
 * <p>
 * Дано целое число, содержащее количество килобайт:
 *
 * int kb = 35;
 * Переведите это значение в байты.
 */

public class _154_KbtToBt {
    public static void main (String[] args) {
        int kb = 35;
        System.out.println("Значение кб в байтах: " + kb * 1024);
    }
}
