package code_mu.level1;

/**
 * Уровень 19 задачника Java
 * № 192
 * <p>
 * Напишите программу, которая узнает, сколько секунд содержится в сутках.
 */

public class _192_SecondsInDay {
    static final int SECONDS_IN_DAY = 24 * 60 * 60;
    public static void main (String[] args) {
        System.out.println("Секунд в сутках: " + SECONDS_IN_DAY);
    }
}
